<?xml version="1.0" ?>
<net name="automatic-tensorrt" version="10">
	<layers>
		<layer id="0" name="r1i" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 16, 45, 80"/>
			<output>
				<port id="0" names="r1i" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="r2i" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 20, 23, 40"/>
			<output>
				<port id="0" names="r2i" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="r3i" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 40, 12, 20"/>
			<output>
				<port id="0" names="r3i" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="r4i" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 64, 6, 10"/>
			<output>
				<port id="0" names="r4i" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="src" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 180, 320"/>
			<output>
				<port id="0" names="src" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Resize_1/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="5606" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="1105" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="4" size="16"/>
			<output>
				<port id="0" names="1105" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Resize_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Resize_1/Add_input_port_1/value560532058" type="Const" version="opset1">
			<data element_type="f32" offset="16" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Resize_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Resize_1/Floor" type="Floor" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="5610" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Resize_1/StridedSlice_sizes_input_port_1/value558732547" type="Const" version="opset1">
			<data element_type="i64" offset="20" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Resize_1/StridedSlice_sizes_input_port_2/value558932316" type="Const" version="opset1">
			<data element_type="i64" offset="28" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Resize_1/StridedSlice_sizes_input_port_3/value559132322" type="Const" version="opset1">
			<data element_type="i64" offset="36" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Resize_1/StridedSlice_sizes" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Resize_1/StridedSlice_scales561732709" type="Const" version="opset1">
			<data element_type="f32" offset="44" shape="2" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Resize_1/axis560132052" type="Const" version="opset1">
			<data element_type="i64" offset="52" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Resize_1" type="Interpolate" version="opset4">
			<data antialias="false" coordinate_transformation_mode="pytorch_half_pixel" cube_coeff="-0.75" mode="linear_onnx" nearest_mode="floor" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" shape_calculation_mode="scales"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" names="389" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="ReduceMean_416/axis" type="Const" version="opset1">
			<data element_type="i64" offset="36" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="ReduceMean_416" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="877" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Concat_417" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" names="878" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_mul_12965" type="Const" version="opset1">
			<data element_type="f16" offset="68" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Div_5/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="data_add_12967" type="Const" version="opset1">
			<data element_type="f16" offset="74" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Sub_3/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="393" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="944" type="Const" version="opset1">
			<data element_type="f16" offset="80" shape="16, 3, 3, 3" size="864"/>
			<output>
				<port id="0" names="944" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_6/Dims7387" type="Const" version="opset1">
			<data element_type="f16" offset="944" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="943" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_7" type="Const" version="opset1">
			<data element_type="f16" offset="976" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="396" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Add_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="397" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Clip_11" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="400" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_12" type="Const" version="opset1">
			<data element_type="f16" offset="978" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="401" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Div_13" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="402" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Mul_14" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" names="403" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="947" type="Const" version="opset1">
			<data element_type="f16" offset="980" shape="16, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" names="947" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_15/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_15/Dims7087" type="Const" version="opset1">
			<data element_type="f16" offset="1268" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_15" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="946" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Relu_16" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="406" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="950" type="Const" version="opset1">
			<data element_type="f16" offset="1300" shape="16, 16, 1, 1" size="512"/>
			<output>
				<port id="0" names="950" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_17/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_17/Dims7369" type="Const" version="opset1">
			<data element_type="f16" offset="1812" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="949" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Add_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" names="409" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="953" type="Const" version="opset1">
			<data element_type="f16" offset="1844" shape="64, 16, 1, 1" size="2048"/>
			<output>
				<port id="0" names="953" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_19/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_19/Dims7345" type="Const" version="opset1">
			<data element_type="f16" offset="3892" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="952" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Relu_20" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="412" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="956" type="Const" version="opset1">
			<data element_type="f16" offset="4020" shape="64, 1, 1, 3, 3" size="1152"/>
			<output>
				<port id="0" names="956" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_21/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_21/Dims7111" type="Const" version="opset1">
			<data element_type="f16" offset="5172" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="955" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Relu_22" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="415" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="959" type="Const" version="opset1">
			<data element_type="f16" offset="5300" shape="24, 64, 1, 1" size="3072"/>
			<output>
				<port id="0" names="959" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_23/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_23/Dims7117" type="Const" version="opset1">
			<data element_type="f16" offset="8372" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_23" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="958" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="962" type="Const" version="opset1">
			<data element_type="f16" offset="8420" shape="72, 24, 1, 1" size="3456"/>
			<output>
				<port id="0" names="962" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_24/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_24/Dims7141" type="Const" version="opset1">
			<data element_type="f16" offset="11876" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="961" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Relu_25" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="420" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="965" type="Const" version="opset1">
			<data element_type="f16" offset="12020" shape="72, 1, 1, 3, 3" size="1296"/>
			<output>
				<port id="0" names="965" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_26/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_26/Dims7051" type="Const" version="opset1">
			<data element_type="f16" offset="13316" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_26" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="964" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Relu_27" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="423" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="968" type="Const" version="opset1">
			<data element_type="f16" offset="13460" shape="24, 72, 1, 1" size="3456"/>
			<output>
				<port id="0" names="968" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_28/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_28/Dims7435" type="Const" version="opset1">
			<data element_type="f16" offset="16916" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="967" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Add_29" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" names="426" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="971" type="Const" version="opset1">
			<data element_type="f16" offset="16964" shape="72, 24, 1, 1" size="3456"/>
			<output>
				<port id="0" names="971" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_30/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_30/Dims7159" type="Const" version="opset1">
			<data element_type="f16" offset="20420" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_30" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="970" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Relu_31" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="429" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="974" type="Const" version="opset1">
			<data element_type="f16" offset="20564" shape="72, 1, 1, 5, 5" size="3600"/>
			<output>
				<port id="0" names="974" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_32/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>23</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_32/Dims7405" type="Const" version="opset1">
			<data element_type="f16" offset="24164" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="973" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Relu_33" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="432" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="687" type="Const" version="opset1">
			<data element_type="i64" offset="20" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="87" name="GlobalAveragePool_34/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="GlobalAveragePool_34/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="GlobalAveragePool_34/input_rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" offset="24308" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="GlobalAveragePool_34/input_rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="91" name="689" type="Const" version="opset1">
			<data element_type="i64" offset="36" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="92" name="GlobalAveragePool_34/global_pooling_reduce_axis" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="GlobalAveragePool_34/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="433" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="backbone.features.4.block.2.fc1.weight" type="Const" version="opset1">
			<data element_type="f16" offset="24316" shape="24, 72, 1, 1" size="3456"/>
			<output>
				<port id="0" names="backbone.features.4.block.2.fc1.weight" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_35/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_35/Dims7255" type="Const" version="opset1">
			<data element_type="f16" offset="27772" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_35" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="434" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Relu_36" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="435" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="backbone.features.4.block.2.fc2.weight" type="Const" version="opset1">
			<data element_type="f16" offset="27820" shape="72, 24, 1, 1" size="3456"/>
			<output>
				<port id="0" names="backbone.features.4.block.2.fc2.weight" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_37/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_37/Dims7495" type="Const" version="opset1">
			<data element_type="f16" offset="31276" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_37" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="436" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="HardSigmoid_38/HardSigmoid__input_port_1/value" type="Const" version="opset1">
			<data element_type="f16" offset="978" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="104" name="HardSigmoid_38/HardSigmoid__input_port_2/value" type="Const" version="opset1">
			<data element_type="f16" offset="31420" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="105" name="HardSigmoid_38/HardSigmoid_" type="HardSigmoid" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16"/>
				<port id="2" precision="FP16"/>
			</input>
			<output>
				<port id="3" names="437" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Mul_39" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" names="438" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="977" type="Const" version="opset1">
			<data element_type="f16" offset="31422" shape="40, 72, 1, 1" size="5760"/>
			<output>
				<port id="0" names="977" precision="FP16">
					<dim>40</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_40/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>40</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_40/Dims7447" type="Const" version="opset1">
			<data element_type="f16" offset="37182" shape="1, 40, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_40" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="976" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="980" type="Const" version="opset1">
			<data element_type="f16" offset="37262" shape="120, 40, 1, 1" size="9600"/>
			<output>
				<port id="0" names="980" precision="FP16">
					<dim>120</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_41/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>120</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_41/Dims7249" type="Const" version="opset1">
			<data element_type="f16" offset="46862" shape="1, 120, 1, 1" size="240"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="979" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Relu_42" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="443" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="983" type="Const" version="opset1">
			<data element_type="f16" offset="47102" shape="120, 1, 1, 5, 5" size="6000"/>
			<output>
				<port id="0" names="983" precision="FP16">
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_43/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Conv_43/Dims7291" type="Const" version="opset1">
			<data element_type="f16" offset="53102" shape="1, 120, 1, 1" size="240"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_43" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="982" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Relu_44" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="446" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="692" type="Const" version="opset1">
			<data element_type="i64" offset="20" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="122" name="GlobalAveragePool_45/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="GlobalAveragePool_45/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
