<?xml version="1.0" ?>
<net name="new8" version="10">
	<layers>
		<layer id="0" name="r1i" type="Parameter" version="opset1">
			<data shape="1, 16, 270, 480" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="r1i">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="r2i" type="Parameter" version="opset1">
			<data shape="1, 20, 135, 240" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="r2i">
					<dim>1</dim>
					<dim>20</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="r3i" type="Parameter" version="opset1">
			<data shape="1, 40, 68, 120" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="r3i">
					<dim>1</dim>
					<dim>40</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="r4i" type="Parameter" version="opset1">
			<data shape="1, 64, 34, 60" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="r4i">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="src" type="Parameter" version="opset1">
			<data shape="1, 3, 1080, 1920" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="src">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Resize_1/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="14568" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="2115" type="Const" version="opset1">
			<data element_type="f32" shape="4" offset="0" size="16"/>
			<output>
				<port id="0" precision="FP32" names="2115">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Resize_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Resize_1/Add_input_port_1/value1456767295" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="16" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Resize_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Resize_1/Floor" type="Floor" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="14572" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Resize_1/StridedSlice_sizes_input_port_1/value1454968354" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Resize_1/StridedSlice_sizes_input_port_2/value1455167613" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="28" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Resize_1/StridedSlice_sizes_input_port_3/value1455367355" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="36" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Resize_1/StridedSlice_sizes" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0" ellipsis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Resize_1/StridedSlice_scales1457966710" type="Const" version="opset1">
			<data element_type="f32" shape="2" offset="44" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Resize_1/axis1456367067" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="52" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Resize_1" type="Interpolate" version="opset4">
			<data mode="linear_onnx" shape_calculation_mode="scales" coordinate_transformation_mode="pytorch_half_pixel" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="717">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="ReduceMean_884/axis" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="36" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="ReduceMean_884" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2041">
					<dim>1</dim>
					<dim>1</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Concat_885" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2042">
					<dim>1</dim>
					<dim>4</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_mul_32751" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="68" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Div_5/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="data_add_32753" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="80" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Sub_3/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="721">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="BatchNormalization_7/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="92" size="1728"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.0.0.weight">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_6" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="data_add_3275632761" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="1820" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="BatchNormalization_7/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="723">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_8" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1884" size="4"/>
			<output>
				<port id="0" precision="FP32" names="728">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Add_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="729">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Clip_12" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="732">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_13" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1888" size="4"/>
			<output>
				<port id="0" precision="FP32" names="733">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Div_14" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="734">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Mul_15" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="735">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="BatchNormalization_17/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 3, 3" offset="1892" size="576"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.1.block.0.0.weight">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_16" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="data_add_3276432769" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="2468" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="BatchNormalization_17/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="737">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Relu_18" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="742">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="BatchNormalization_20/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 1, 1" offset="2532" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.1.block.1.0.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_19" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="data_add_3277232777" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="3556" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="BatchNormalization_20/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="744">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Add_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="749">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="BatchNormalization_23/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 1, 1" offset="3620" size="4096"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.2.block.0.0.weight">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_22" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="data_add_3278032785" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="7716" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="BatchNormalization_23/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="751">
					<dim>1</dim>
					<dim>64</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Relu_24" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="756">
					<dim>1</dim>
					<dim>64</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="BatchNormalization_26/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 3, 3" offset="7972" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.2.block.1.0.weight">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_25" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="data_add_3278832793" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="10276" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="BatchNormalization_26/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="758">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Relu_27" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="763">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="BatchNormalization_29/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="24, 64, 1, 1" offset="10532" size="6144"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.2.block.2.0.weight">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_28" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="data_add_3279632801" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="16676" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="BatchNormalization_29/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="765">
					<dim>1</dim>
					<dim>24</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="BatchNormalization_31/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="72, 24, 1, 1" offset="16772" size="6912"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.3.block.0.0.weight">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_30" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="data_add_3280432809" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="23684" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="BatchNormalization_31/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="771">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Relu_32" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="776">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="BatchNormalization_34/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="72, 1, 1, 3, 3" offset="23972" size="2592"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.3.block.1.0.weight">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_33" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="data_add_3281232817" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="26564" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="BatchNormalization_34/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="778">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Relu_35" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="783">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="BatchNormalization_37/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="24, 72, 1, 1" offset="26852" size="6912"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.3.block.2.0.weight">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_36" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="data_add_3282032825" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="33764" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="BatchNormalization_37/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="785">
					<dim>1</dim>
					<dim>24</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Add_38" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="790">
					<dim>1</dim>
					<dim>24</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="BatchNormalization_40/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="72, 24, 1, 1" offset="33860" size="6912"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.4.block.0.0.weight">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_39" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="data_add_3282832833" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="40772" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="BatchNormalization_40/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="792">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Relu_41" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="797">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="BatchNormalization_43/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="72, 1, 1, 5, 5" offset="41060" size="7200"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.4.block.1.0.weight">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_42" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="data_add_3283632841" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="48260" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="BatchNormalization_43/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="799">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Relu_44" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="804">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="1712" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="87" name="GlobalAveragePool_45/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="GlobalAveragePool_45/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="GlobalAveragePool_45/input_rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="48548" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="GlobalAveragePool_45/input_rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="91" name="1714" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="36" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="92" name="GlobalAveragePool_45/global_pooling_reduce_axis" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="GlobalAveragePool_45/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="805">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="backbone.features.4.block.2.fc1.weight" type="Const" version="opset1">
			<data element_type="f32" shape="24, 72, 1, 1" offset="48556" size="6912"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.4.block.2.fc1.weight">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_46/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_46/Dims18257" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="55468" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_46" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="806">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Relu_47" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="807">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="backbone.features.4.block.2.fc2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="72, 24, 1, 1" offset="55564" size="6912"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.4.block.2.fc2.weight">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_48/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_48/Dims18467" type="Const" version="opset1">
			<data element_type="f32" shape="1, 72, 1, 1" offset="62476" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_48" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="808">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="HardSigmoid_49/HardSigmoid__input_port_1/value" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1888" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="HardSigmoid_49/HardSigmoid__input_port_2/value" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="62764" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="HardSigmoid_49/HardSigmoid_" type="HardSigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32"/>
				<port id="2" precision="FP32"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="809">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Mul_50" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="810">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="BatchNormalization_52/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="40, 72, 1, 1" offset="62768" size="11520"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.4.block.3.0.weight">
					<dim>40</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_51" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>40</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="data_add_3284432849" type="Const" version="opset1">
			<data element_type="f32" shape="1, 40, 1, 1" offset="74288" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="BatchNormalization_52/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="812">
					<dim>1</dim>
					<dim>40</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="BatchNormalization_54/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="120, 40, 1, 1" offset="74448" size="19200"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.5.block.0.0.weight">
					<dim>120</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_53" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>120</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="data_add_3285232857" type="Const" version="opset1">
			<data element_type="f32" shape="1, 120, 1, 1" offset="93648" size="480"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="BatchNormalization_54/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="818">
					<dim>1</dim>
					<dim>120</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Relu_55" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="823">
					<dim>1</dim>
					<dim>120</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="BatchNormalization_57/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="120, 1, 1, 5, 5" offset="94128" size="12000"/>
			<output>
				<port id="0" precision="FP32" names="backbone.features.5.block.1.0.weight">
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_56" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="data_add_3286032865" type="Const" version="opset1">
			<data element_type="f32" shape="1, 120, 1, 1" offset="106128" size="480"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="BatchNormalization_57/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
